Ran Plan for dir: `eu-central-1/production` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.injest_bucket.aws_s3_bucket.federated-engineers-bucket will be created
+ resource "aws_s3_bucket" "federated-engineers-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "federated-engineers-production-elite-data-lake"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "eu-central-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"        = "federated-engineers-production-elite-data-lake"
          + "Service"     = "airflow"
          + "environment" = "production"
          + "team"        = "elite"
          + "terraform"   = "true"
        }
      + tags_all                    = {
          + "Name"        = "federated-engineers-production-elite-data-lake"
          + "Service"     = "airflow"
          + "environment" = "production"
          + "team"        = "elite"
          + "terraform"   = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.injest_bucket.aws_s3_bucket_versioning.versioning will be created
+ resource "aws_s3_bucket_versioning" "versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "eu-central-1"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d eu-central-1/production
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://161.97.80.18:4141/lock?id=Federated-Engineers%252Fcloud-infrastructures%252Feu-central-1%252Fproduction%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d eu-central-1/production
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```